"""Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), 
не превосходящие числа N.
10 -> 1 2 4 8"""

s = int(input('Введите показатель степени: '))
n = int(input('Введите максимальный предел степени: '))

x = 1

count = 1
for i in range(n):
    if i == 0:
        print('2^0 = 1')
    x = x * s
    if x <= n: 
        print(f'2^{count} = {x}')
        count += 1

print(f'Последнее число, возведенное в степень: {count}')


"""
2^0 = 1
2^1 = 2        2^11 = 2048       2^21 = 2 097 152        2^31 = 2 147 483 648
2^2 = 4        2^12 = 4096       2^22 = 4 194 304        2^32 = 4 294 967 296
2^3 = 8        2^13 = 8192       2^23 = 8 388 608
2^4 = 16       2^14 = 16384      2^24 = 16 777 216
2^5 = 32       2^15 = 32768      2^25 = 33 554 432
2^6 = 64       2^16 = 65536      2^26 = 67 108 864
2^7 = 128      2^17 = 131072     2^27 = 134 217 728
2^8 = 256      2^18 = 262144     2^28 = 268 435 456
2^9 = 512      2^19 = 524288     2^29 = 536 870 912
2^10 = 1024    2^20 = 1048576    2^30 = 1 073 741 824
"""